[rule]
author = ["NVB"]
description = "Triggers when more than 1000 queries to a web server are observed in a 5 minute window"
from = "now-9m" # default, change as needed
#index = ["logs-endpoint.events.process*"]
language = "eql"
#license = "Elastic License v2"
name = "Excessive Web Traffic (via Git)"
#note = "Note"
#references = [
#    "https://github.com/center-for-threat-informed-defense/adversary_emulation_library/blob/master/apt29/Archive/CALDERA_DIY/evals/payloads/stepSeventeen_email.ps1",
#]
risk_score = 25
rule_id = "4"
severity = "low"
type = "threshold"
query = 'event.dataset : "zeek.http"'

# if threshold alert:
[rule.threshold]
field = ["source.ip"]
value = 1000
threshold = 50


[[rule.threat]] # Example Tactic, Technique, Sub-Technique
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1046" #T id
name = "Network Service Discovery"
reference = "https://attack.mitre.org/techniques/T1046/"

[rule.threat.tactic]
id = "TA0007" # TA id
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"

# Optional Fields: 
# throttle: 7d
# version: 1
# interval: 5m


